In [1]:
import pandas as pd
import numpy as np
from dask import dataframe as dd

In [52]:
# df = pd.read_csv("twitter_data_emotions.csv", chunksize=2000000)

In [2]:
# df = pd.read_csv("twitter_data_emotions.csv", header=None, nrows=700000, encoding='latin-1')
df = pd.read_csv("twitter_data_emotions.csv", header=None, encoding='latin-1')

In [3]:
df.columns = ['Target', 'Id', 'Date', 'Flag', 'User', 'Tweet']
df.head()

,Target,Id,Date,Flag,User,Tweet
0,0,1467810369,Mon Apr 06 22:19:45 PDT 2009,NO_QUERY,_TheSpecialOne_,"@switchfoot http://twitpic.com/2y1zl - Awww, t..."
1,0,1467810672,Mon Apr 06 22:19:49 PDT 2009,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...
2,0,1467810917,Mon Apr 06 22:19:53 PDT 2009,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...
3,0,1467811184,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,ElleCTF,my whole body feels itchy and like its on fire
4,0,1467811193,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,Karoli,"@nationwideclass no, it's not behaving at all...."

In [4]:
df.shape

(1600000, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1600000 entries, 0 to 1599999
Data columns (total 6 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   Target  1600000 non-null  int64
 1   Id      1600000 non-null  int64
 2   Date    1600000 non-null  object
 3   Flag    1600000 non-null  object
 4   User    1600000 non-null  object
 5   Tweet   1600000 non-null  object
dtypes: int64(2), object(4)
memory usage: 73.2+ MB

In [6]:
df['User'].value_counts()

lost_dog           549
webwoke            345
tweetpet           310
SallytheShizzle    281
VioletsCRUK        279
                  ...
67trinity            1
Sibby                1
mAnyA_15             1
49ersfan111          1
bpbabe               1
Name: User, Length: 659775, dtype: int64

In [7]:
# df['Date'] = pd.to_datetime(df['Date'])
df['Date'].value_counts()

Mon Jun 15 12:53:14 PDT 2009    20
Fri May 29 13:40:04 PDT 2009    17
Fri May 22 05:10:17 PDT 2009    17
Mon Jun 15 13:39:50 PDT 2009    17
Fri Jun 05 14:13:07 PDT 2009    16
                                ..
Sun Jun 07 12:36:07 PDT 2009     1
Sun Jun 07 12:36:04 PDT 2009     1
Sun Jun 07 12:36:03 PDT 2009     1
Sun Jun 07 12:36:02 PDT 2009     1
Tue Jun 16 08:40:50 PDT 2009     1
Name: Date, Length: 774363, dtype: int64

In [9]:
# df["Date"] = pd.to_datetime(df["Date"])

In [8]:
df['Flag'].value_counts()

NO_QUERY    1600000
Name: Flag, dtype: int64

In [9]:
df['Target'].value_counts()

0    800000
4    800000
Name: Target, dtype: int64

In [10]:
df.duplicated().sum()

0

In [11]:
df.head()

,Target,Id,Date,Flag,User,Tweet
0,0,1467810369,Mon Apr 06 22:19:45 PDT 2009,NO_QUERY,_TheSpecialOne_,"@switchfoot http://twitpic.com/2y1zl - Awww, t..."
1,0,1467810672,Mon Apr 06 22:19:49 PDT 2009,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...
2,0,1467810917,Mon Apr 06 22:19:53 PDT 2009,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...
3,0,1467811184,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,ElleCTF,my whole body feels itchy and like its on fire
4,0,1467811193,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,Karoli,"@nationwideclass no, it's not behaving at all...."

In [12]:
df.tail()

,Target,Id,Date,Flag,User,Tweet
1599995,4,2193601966,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,AmandaMarie1028,Just woke up. Having no school is the best fee...
1599996,4,2193601969,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,TheWDBoards,TheWDB.com - Very cool to hear old Walt interv...
1599997,4,2193601991,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,bpbabe,Are you ready for your MoJo Makeover? Ask me f...
1599998,4,2193602064,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,tinydiamondz,Happy 38th Birthday to my boo of alll time!!! ...
1599999,4,2193602129,Tue Jun 16 08:40:50 PDT 2009,NO_QUERY,RyanTrevMorris,happy #charitytuesday @theNSPCC @SparksCharity...

In [14]:
# removed PDT from the Date
df['Date'] = df['Date'].str.replace('PDT', '')

In [15]:
df['Tweet'][3]

'my whole body feels itchy and like its on fire '

In [17]:
# converts to date and time - Don't run takes longer time to finish executing******
df["Date"] = pd.to_datetime(df["Date"])

In [18]:
# sanity check converted to date and time
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1600000 entries, 0 to 1599999
Data columns (total 6 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   Target  1600000 non-null  int64
 1   Id      1600000 non-null  int64
 2   Date    1600000 non-null  datetime64[ns]
 3   Flag    1600000 non-null  object
 4   User    1600000 non-null  object
 5   Tweet   1600000 non-null  object
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 73.2+ MB

In [19]:
df['Date'].dt.year.value_counts()

2009    1600000
Name: Date, dtype: int64

In [20]:
df_chunk = df.head(10000).copy()

In [21]:
# Pulling all the months
col_month = df_chunk["Date"].dt.month

In [22]:
col_month

0       4
1       4
2       4
3       4
4       4
       ..
9995    4
9996    4
9997    4
9998    4
9999    4
Name: Date, Length: 10000, dtype: int64

In [58]:
df_chunk = pd.concat([df_chunk, col_month], axis=1).rename(columns={'Date': 'Month'})

In [59]:
df_chunk.head()

,Target,Id,Month,Flag,User,Tweet,Month
0,0,1467810369,2009-04-06 22:19:45,NO_QUERY,_TheSpecialOne_,"@switchfoot http://twitpic.com/2y1zl - Awww, t...",4
1,0,1467810672,2009-04-06 22:19:49,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...,4
2,0,1467810917,2009-04-06 22:19:53,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...,4
3,0,1467811184,2009-04-06 22:19:57,NO_QUERY,ElleCTF,my whole body feels itchy and like its on fire,4
4,0,1467811193,2009-04-06 22:19:57,NO_QUERY,Karoli,"@nationwideclass no, it's not behaving at all....",4

In [29]:
df['Date'].dt.month.value_counts()

6    923608
5    576367
4    100025
Name: Date, dtype: int64